---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeNosingProfile
source: html/0f6e73b7-5727-624e-0a8b-9f901b01bed4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsTrisertypeNosingProfile Property

"Nosing Profile"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsTrisertypeNosingProfile { get; }
```